{
  "backend/main.mo": "Motoko actor implementing user profiles, 1:1 chat threads, message storage, access control checks, and query/update methods for chats and profiles.",
  "feature_evidence.json": "Feature-to-file mapping report listing implemented features, related files, components, and confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of various frontend files in the project.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables, light/dark theme values, and global UI theming.",
  "frontend/index.html": "Simple HTML entry point loading the React app via main.tsx and setting app metadata.",
  "frontend/src/App.tsx": "Root React component managing authentication, routing between screens, theme provider, and profile setup flow.",
  "frontend/src/components/AppHeader.tsx": "Header bar with navigation, theme toggle, profile button, and logout logic.",
  "frontend/src/components/ChatThreadHeader.tsx": "Thread header showing the other user's profile info, avatar initials, and shortened principal ID.",
  "frontend/src/components/ChatThreadItem.tsx": "Chat list item displaying user details, unread badge, last activity time, and click navigation behavior.",
  "frontend/src/components/MessageBubble.tsx": "Displays a chat message bubble styled based on sender and shows a formatted timestamp.",
  "frontend/src/components/MessageComposer.tsx": "Provides a textarea and send button for composing messages with validation and submit handling.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal dialog for entering and saving a user's display name during initial setup.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication state and logic using Internet Identity, exposing identity, login, and logout.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for profiles, chats, messages, and sending messages using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup with light/dark theme variables and base typography styling.",
  "frontend/src/lib/validation.ts": "Contains validation helpers for message content and display names with length checks.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers and renders the root component.",
  "frontend/src/screens/ChatListScreen.tsx": "Displays the user's chat list and provides a dialog to start new chats by entering a Principal ID.",
  "frontend/src/screens/ChatThreadScreen.tsx": "Displays a message thread, loads and marks messages as read, auto-scrolls, and renders bubbles plus a composer.",
  "frontend/src/screens/ProfileScreen.tsx": "Shows and edits the user's display name and principal ID with save and copy functionality.",
  "frontend/src/screens/SignInScreen.tsx": "Renders a branded sign‑in page using Internet Identity with a simple login button.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL params, persisting them in sessionStorage, and cleaning them from the URL hash.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins for the app’s UI.",
  "project_state.json": "Stores project metadata, feature list, requirements, and branding/image guidelines for the Private Chat app."
}